<a href='https://i.ibb.co/TPq9FfH/Nilakantha-Singh-Deo.jpg'> <img src='https://i.ibb.co/TPq9FfH/Nilakantha-Singh-Deo.jpg' /></a>

In [1]:
%%HTML
<style type="text/css">
table.dataframe td, table.dataframe th {
    border: 1px  black solid !important;
  color: black !important;
}
</style>

In [4]:
import numpy as np
import pandas as pd

In [5]:
from numpy.random import randn

#### Note: W X Y Z are panda series

In [6]:
#seed is to generate similar random values
np.random.seed(seed=101)
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### Getting the column or multiple columns

In [7]:
print ('Get columns:>>\n',df['W'],'\nType of column>>\n',type(df['W']))

Get columns:>>
 A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64
Type of column>>
 <class 'pandas.core.series.Series'>

In [8]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

#### CREATE A NEW COLUMN

In [9]:
newColumn=df['new']=df['W']+df['X']
print(newColumn,'\noriginal DF\n',df)

A    3.334983
B    0.331800
C   -1.278046
D   -0.570177
E    2.169552
dtype: float64
original DF
           W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

#### Dropping a column

In [10]:
#cant drop with just the column name
#df.drop('new')

#axis=0 => rows and axis=1 => columns
df.drop('new',axis=1)
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [11]:
#df.drop('new',axis=1) does not delete or drop the column, need to add in place key word
df.drop('new',axis=1,inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [12]:
#for rows default is x=-0
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [13]:
#similar to numpy DATAFRAME shape returns a touple
df.shape
#so its a touple with x=0 is row and x=1 is the column

(5, 4)

#### Access the rows

In [14]:
#rows are also series
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [15]:
#alternatively with numerical based index
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [16]:
#Get the value of the df subset
df.loc['B','W']

0.6511179479432686

In [17]:
#Get the subset of the dataframe
print(df)
df.loc[['A','B'],['W','Y']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077